{
   "profile": "tabular-data-package",
   "name": "table_schema_specs_for_level_0_c2m2_encoding_of_dcc_metadata",
   "title": "A complete list of schematic specifications for the resources (TSV table files) that will be used to represent C2M2 Level 0 DCC metadata prior to ingest into the C2M2 database system.",
   "resources": [
      {
         "profile": "tabular-data-resource",
         "name": "file",
         "title": "file",
         "path": "file.tsv",
         "description": "A Level 0 digital asset",
         "schema": {
            "fields": [
               {
                  "name": "id_namespace",
                  "description": "String identifier devised by the DCC managing this file (cleared by CFDE-CC to avoid clashes with any preexisting id_namespace values). The value of this property will be used together with local_id as a composite key structure formally identifying Level 0 file entities within the total C2M2 data space.",
                  "type": "string",
                  "constraints": {
                     "required": true
                  }
               },
               {
                  "name": "local_id",
                  "description": "Unrestricted-format string identifying this file: can be any string as long as it uniquely identifies each file within the scope defined by the accompanying id_namespace value.",
                  "type": "string",
                  "constraints": {
                     "required": true,
                     "unique": true
                  }
               },
               {
                  "name": "persistent_id",
                  "description": "A permanent, resolvable URI permanently attached to this file, meant to serve as a permanent address to which landing pages (which summarize metadata associated with this file) and other relevant annotations and functions can optionally be attached, including information enabling resolution to a network location from which the file can be downloaded. Actual network locations must not be embedded directly within this identifier: one level of indirection is required in order to protect persistent_id values from changes in network location over time as files are moved around.",
                  "type": "string",
                  "format": "uri"
               },
               {
                  "name": "size_in_bytes",
                  "description": "The size of this file in bytes.",
                  "type": "integer"
               },
               {
                  "name": "sha256",
                  "description": "The output of the SHA-256 cryptographic hash function after being run on this file. One or both of sha256 and md5 is required. sha256 is preferred.",
                  "type": "string",
                  "format": "binary"
               },
               {
                  "name": "md5",
                  "description": "The output of the MD5 message-digest algorithm after being run as a cryptographic hash function on this file. One or both of sha256 and md5 is required. sha256 is preferred.",
                  "type": "string",
                  "format": "binary"
               },
               {
                  "name": "filename",
                  "description": "A filename with no prepended PATH information.",
                  "type": "string",
                  "constraints": {
                     "pattern": "^[^\/\\:]+$"
                  }
               }
            ],
            "missingValues": [ "" ],
            "primaryKey": [ "id_namespace", "local_id" ]
         }
      }
   ]
}

