{
   "profile": "tabular-data-package",
   "name": "table_schema_specs_for_level_0_c2m2_encoding_of_dcc_metadata",
   "title": "A complete list of schematic specifications for the resources (TSV table files) that will be used to represent C2M2 Level 0 DCC metadata prior to ingest into the C2M2 database system.",
   "resources": [
      {
         "profile": "tabular-data-resource",
         "name": "file",
         "title": "file",
         "path": "file.tsv",
         "description": "A Level 0 digital asset",
         "schema": {
            "fields": [
               {
                  "name": "id_namespace",
                  "description": "String identifier assigned by CFDE to the DCC managing this file. The value of this field will be used together with id (assigned to each file by the DCC that owns it) as a paired-key structure formally identifying Level 0 file entities within the total C2M2 data space.",
                  "type": "string",
                  "constraints": {
                     "required": true
                  }
               },
               {
                  "name": "id",
                  "description": "Unrestricted-format string identifying this file, assigned by the DCC managing it. Can be any string as long as it uniquely identifies each file within the scope of a single Level 0 metadata submission.",
                  "type": "string",
                  "constraints": {
                     "required": true,
                     "unique": true
                  }
               },
               {
                  "name": "persistent_id",
                  "description": "A persistent, resolvable URI generated by a DCC and permanently attached to this file, to serve as a permanent address to which landing pages and other relevant decorations can eventually be attached to this file, including (optionally) resolution to a network location from which the file can be downloaded. Actual network locations MUST NOT be embedded directly within this identifier.",
                  "type": "string",
                  "format": "uri"
               },
               {
                  "name": "size_in_bytes",
                  "description": "The size of a file in bytes.",
                  "type": "integer"
               },
               {
                  "name": "sha256",
                  "description": "The output of the SHA-256 cryptographic hash function after being run on this file. One or both of sha256 and md5 is required. sha256 is preferred.",
                  "type": "string",
                  "format": "binary"
               },
               {
                  "name": "md5",
                  "description": "The output of the MD5 message-digest algorithm after being run as a cryptographic hash function on this file. One or both of sha256 and md5 is required. sha256 is preferred.",
                  "type": "string",
                  "format": "binary"
               },
               {
                  "name": "filename",
                  "description": "A filename with no prepended PATH information.",
                  "type": "string",
                  "constraints": {
                     "pattern": "^[^\/\\:]+$"
                  }
               }
            ],
            "missingValues": [ "" ],
            "primaryKey": [ "id_namespace", "id" ],
            "foreignKeys": [
               {
                  "fields": "id_namespace",
                  "reference": {
                     "resource": "id_namespace",
                     "fields": "id"
                  }
               }
            ]
         }
      },
      {
         "profile": "tabular-data-resource",
         "name": "id_namespace",
         "title": "id_namespace",
         "path": "id_namespace.tsv",
         "description": "INTERNAL CV: Dictionary of CFDE-generated identifier namespaces corresponding to top-level C2M2 metadatasets",
         "schema": {
            "fields": [
               {
                  "name": "id",
                  "description": "A globally unique ID representing this identifier namespace",
                  "type": "string",
                  "constraints": {
                     "required": true,
                     "unique": true
                  }
               },
               {
                  "name": "abbreviation",
                  "description": "A very short display label for this identifier namespace",
                  "type": "string",
                  "constraints": {
                     "pattern": "^[a-zA-Z0-9_]+$"
                  }
               },
               {
                  "name": "name",
                  "description": "A short, human-readable, machine-read-friendly label for this identifier namespace",
                  "type": "string"
               },
               {
                  "name": "description",
                  "description": "A human-readable description of this identifier namespace",
                  "type": "string"
               }
            ],
            "missingValues": [ "" ],
            "primaryKey": "id"
         }
      }
   ]
}

